package kiosk

class Strings {
    val messages = arrayListOf(
        arrayListOf(
            "================================  SHAKESHACK MENU  ================================",
            "  1. BURGERS      | 심플하면서도 맛있는 쉑버거와 그 외 다양한 버거 메뉴",
            "  2. CHICKEN      | 신선한 치킨 통살을 버터밀크에 수비드 튀긴 프리미엄 치킨 버거",
            "  3. CUSTARD      | 매장에서 매일 신선하게 제조하는 쫀득하고 진한 커스터드",
            "  4. CONCRETES    | 커스터드와 다양한 믹스-인이 만나 탄생한 쉐이크쉑만의 디저트 메뉴",
            "  5. DRINKS       | 매장에서 직접 만드는 쉐이크쉑의 음료",
            "===================================================================================",
            "  6. Order        | 장바구니를 확인 후 주문합니다.",
            "  7. Cancel       | 진행중인 주문을 취소합니다.",
            "  8. Coupon       | 할인쿠폰을 확인합니다.",
            "===================================================================================",
            "  9. Delivery     | 배달내역을 확인합니다.",
            "  0. Exit         | 프로그램 종료",
            "===================================================================================",
        ),
        arrayListOf(
            "===================================================================================",
            "  장바구니의 내역을 모두 삭제할까요?",
            "===================================================================================",
            "  [1] 예    [2] 아니오",
        ),
        arrayListOf(
            "===================================================================================",
            "  1. My Coupon    | 사용가능한 할인쿠폰 내역을 확인합니다.",
            "  2. New Coupon   | 새로운 할인쿠폰을 발급받습니다.",
            "===================================================================================",
            "  [0] 뒤로가기"
        ),
        arrayListOf(
            "===================================================================================",
            "  사용하실 수 있는 할인쿠폰이 있습니다. 할인쿠폰을 사용하시겠습니까?",
            "===================================================================================",
            "  [1] 예    [2] 아니오"
            )
    )
}